roomWindFlow/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

backgroundMesh
{
    xMin   -10;
    xMax   110;
    yMin   -10;
    yMax   140;
    zMin    -5;
    zMid    25;
    zMax    45;
    //xCells  20;
    //yCells  40;
    //zCells  16;
    xCells  5;
    yCells  10;
    zCells  4;
}

convertToMeters 1;

vertices
(
    ($!backgroundMesh/xMin $!backgroundMesh/yMin $!backgroundMesh/zMin) // 0
    ($!backgroundMesh/xMax $!backgroundMesh/yMin $!backgroundMesh/zMin) // 1
    ($!backgroundMesh/xMax $!backgroundMesh/yMax $!backgroundMesh/zMin) // 2
    ($!backgroundMesh/xMin $!backgroundMesh/yMax $!backgroundMesh/zMin) // 3

    ($!backgroundMesh/xMin $!backgroundMesh/yMin $!backgroundMesh/zMid) // 4
    ($!backgroundMesh/xMax $!backgroundMesh/yMin $!backgroundMesh/zMid) // 5
    ($!backgroundMesh/xMax $!backgroundMesh/yMax $!backgroundMesh/zMid) // 6
    ($!backgroundMesh/xMin $!backgroundMesh/yMax $!backgroundMesh/zMid) // 7

    ($!backgroundMesh/xMin $!backgroundMesh/yMin $!backgroundMesh/zMax) // 8
    ($!backgroundMesh/xMax $!backgroundMesh/yMin $!backgroundMesh/zMax) // 9
    ($!backgroundMesh/xMax $!backgroundMesh/yMax $!backgroundMesh/zMax) // 10
    ($!backgroundMesh/xMin $!backgroundMesh/yMax $!backgroundMesh/zMax) // 11
);

blocks
(
    //hex (0 1 2 3 8 9 10 11)
    //(
        //$!backgroundMesh/xCells
        //$!backgroundMesh/yCells
        //$!backgroundMesh/zCells
    //)
    //simpleGrading (1 1 1)

    hex (0 1 2 3 4 5 6 7)
    (
        $!backgroundMesh/xCells
        $!backgroundMesh/yCells
        $!backgroundMesh/zCells
    )
    simpleGrading (1 1 1)

    hex (4 5 6 7 8 9 10 11)
    (
        $!backgroundMesh/xCells
        $!backgroundMesh/yCells
        $!backgroundMesh/zCells
    )
    simpleGrading (1 1 1)
);

boundary
(
    //inlet
    //{
        //type patch;
        //faces
        //(
            //(0 3 7 4)
            //(4 7 11 8)
        //);
    //}

    //outlet
    //{
        //type patch;
        //faces
        //(
            //(5 9 10 6)
        //);
    //}

    //horizontalFace
    //{
        //type patch;
        //faces
        //(
            //(4 5 6 7)
        //);
    //}


    ground
    {
        type wall;
        faces
        (
            (0 1 2 3)
        );
    }

    roof
    {
        type wall;
        faces
        (
            (8 9 10 11)
        );
    }

    backLower
    {
        type wall;
        faces
        (
            (1 5 6 2)

            // outlet
            (5 9 10 6)
        );
    }

    rightWall
    {
        type wall;
        faces
        (
            // inlet
            (0 3 7 4)
            (4 7 11 8)
        );
    }

    back
    {
        type symmetry;
        faces
        (
            (0 4 5 1)
            (4 8 9 5)
        );
    }

    front
    {
        type symmetry;
        faces
        (
            (3 2 6 7)
            (6 7 11 10)
        );
    }

);

// ************************************************************************* //
