roomWindFlow/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#includeEtc "caseDicts/mesh/generation/snappyHexMeshDict.cfg"

castellatedMesh on;
snap            on;
addLayers       off;

geometry
{
    room
    {
        type triSurfaceMesh;
        file "Room.stl"
        name Geometry;
        regions
        {
            // patch name specification 
            // regionNameInSTLfile    {name    patchNameInOpenFOAM;}
            RoomInlet          {name inlet;       } 
            RoomOutlet         {name outlet;      }
            RoomGeometry       {name RoomGeometry;    }
        }
    }





    //room
    //{
        //type triSurfaceMesh;
        //file "Room.stl";
    //}

    //refinementBox
    //{
        //type searchableBox;
        //min  (-1  -1  -1);
        //max  (1  1  1);
    //}
};

castellatedMeshControls
{
    features
    (
      //{ file  "Room.eMesh"; level 1; }
    );

    refinementSurfaces
    {
        room
        {
            level (1 1);
            regions
            {
                // surface region refinement 
                // patch type specification
                // stlRegionName     { level (default feature_angle_resolved); patchInfo { type patchType; }
                inlet     {
                    level (2 2);
                    patchInfo { type wall;         }
                }
                outlet    {
                    level (2 2);
                    patchInfo { type wall;         }
                }
                RoomGeometry  {
                    level (2 2);
                    patchInfo { type wall;          }
                }
            }
            patchInfo { type wall; }
        }
    }

    //refinementRegions
    //{
        //refinementBox
        //{
            //mode    inside;
            //level   2;
        //}
    //}

    locationInMesh (10 10 10); // Offset from (0 0 0) to avoid coinciding with face or edge
    nCellsBetweenLevels 2;
}

snapControls
{
    //explicitFeatureSnap    true;
    //implicitFeatureSnap    false;
}

addLayersControls
{
    layers
    {
        "CAD.*"
        {
            nSurfaceLayers 2;
        }
    }

    relativeSizes       true;
    expansionRatio      1.2;
    finalLayerThickness 0.5;
    minThickness        1e-3;
}

meshQualityControls
{}

writeFlags
(
    // scalarLevels
    // layerSets
    // layerFields
);

mergeTolerance 1e-6;

// ************************************************************************* //
